<template lang="pug">
    .panel
      .info
        .col1 
              b Памятка для фотосессии 
              br
              |- Предоплата 200-500₽ (на выбор)
              br
              |- Предоплата НЕ ВОЗВРАЩАЕТСЯ, либо этот момент обговаривается
              br
              |- Авторская ретушь обговаривается
              br
              |- Я выслушиваю ваши по желания
              br
              |- Будет замечательно, если вы на примере объясните какие фотографии хотите получить (портретные, в полный рост, коллективные и т.д., вплоть до ракурса)
              br
              |- Помните, я фотограф, а не богиня фотошопа🤪
              br
              |- Количество фотографий всегда выходит по разному. Отдаю по максимуму!
              br
              |- Eсть выкуп исходников - 300₽
              br
              |- «Прогулочная фотосессия» - это один человек!
              br
              |- Если вы хотите с подругой либо с ребёнком, это другая категория, соответственно цена выше
              br
              |- Свадьбы проходят по часовой оплате
              br
              |- Максимум 7 часов без подзарядки, остальное время обговаривается при предоставлении времени для заряда аппаратуры
              br
              |- Фотографии скидываю на Яндекс.Диск
              br
              |- Фотографии хранятся пол года
        .col2 
              b ОБЯЗАТЕЛЬНО
              br
              br
              |- Внести предоплату в течении двух суток (если договорились без неё, то не нужно)
              br
              br
              |- Отписаться за сутки до сьемки, иначе съёмка аннулируется
              br
              br
              |- Если вы не хотите, чтобы я публиковала ваши фотографии(вы в положении, нельзя по работе и др) - обговаривать перед съемкой
              br
              br
              |- Если есть возможность, предоставить примеры работ, которые вы бы хотели получить по итогу
      
      router-link(to="/" class="bck") Понятно
      
</template>

<style scoped>
* {
  font-family: "Bellota", cursive;
  font-size: 1.3vw;
  z-index: 99;
}
b {
  font-size: 2vw;
  color: rgb(255, 230, 0);
}
.panel {
  position: fixed;
  width: 90vw;
  height: 45vw;
  background-color: rgba(72, 67, 73, 0.99);
  left: 5vw;
  bottom: 2.5vw;
  border: 3px solid black;
  border-radius: 20px;
}
.info {
  position: absolute;
  width: 90%;
  height: 40vw;
  top: 2.5vw;
  left: 5vw;
  color: white;
  display: flex;
  justify-content: space-between;
}
.col1 {
  width: 50%;
  margin-right: 3%;
  font-size: 1.4vw;
}
.col2 {
  width: 50%;
  margin-left: 3%;
}

.bck {
  color: white;
  text-decoration: none;
  position: absolute;
  bottom: 2.5vw;
  left: 40vw;
  width: 10vw;
  text-align: center;
  background-color: #222;
  border-radius: 20px;
  border: 1px solid white;
}
.bck:hover {
  background-color: white;
  color: #222;
  cursor: pointer;
}
</style>